{
    "project" : [
        {
            "projecttitle" : "Stager",
            "hashtags" : [
                "ui/ux",
                "php backend",
                "react.js",
                "Electron Forge",
                "Desktop App"
            ],
            "color" : "#ECD959",
            "image" : "stagerdms.png",
            "shortdescription" : "<p><strong>A Full backend php built system to generate, archive and build wordpress sites on a cloud host with an a-joining react.js desktop application</strong></p><p>In order to stream line the work of our designers, and provide a better customer experiance, I built a full staging system on an aws host, That can build up to 20 woocomerce and wordpress sites. The sites can be quickly archived, Or un archived on a need to use basis.</p><p>The desktop app built in react, provides a ui/ux dashboard connection to the stager for our designers to easily interact with the php backend, the stager app provides full control and easily allows are designers to build, edit and archive wordpress sites.</p>",
            "link" : [
                {
                }
            ]
        },
        {
            "projecttitle" : "Ban-Tip",
            "hashtags" : [
                "ui design",
                "jquery",
                "web 3",
                "chrome extension",
                "open source"
            ],
            "color" : "#ECD959",
            "image" : "bantip.webp",
            "shortdescription" : "<p><strong>An open source project, adding tip functionality to the crypto banano sub reddit.</strong></p><p>The chrome extension was built to utilize the reddits tip bot which is difficult for new commers to instantly use. </p><p>Keeping track of your current tip bot balance and setting default tips is a simple use of this extension. Soon allowing the additional functionality of connecting your seed phrase to the wallet and all then being able to us it to tip people on other sites.</p><p>I intend to add it to twitter and other sites soon</p>",
            "link" : [
                {
                    "Firefox" : "https://addons.mozilla.org/en-GB/firefox/addon/bantip-tip-banano-on-reddit/",
                    "Chrome" : "https://chrome.google.com/webstore/detail/bantip/kcbnafimhapdbckikobaacfmonlbikbn?hl=en-GB", 
                    "Github" : "https://github.com/Arxhtects/BanTip"
                }
            ]
        },
        {
            "projecttitle" : "DMS (Depreciated)",
            "hashtags" : [
                "node",
                "php",
                "electron js",
                "desktop app",
                "ui design"
            ],
            "color" : "#C15AC1",
            "image" : "SWdms.webp",
            "shortdescription" : "<p>While working under sitewizard I developed a desktop app. It is used to speed up the process of building and selling websites. A form is generated, from the app. </p><p>The client can fill out the form, and all the details necessary are provided to the designers in the application. They can then press 'build' this will then generate a base wordpress site on a  development link for our designers to work on. </p><p>It will add all the plugins we use as a company, select the theme if the client chose one, setup the database and everything so that it is ready to start as soon as possible.</p>",
            "link" : [
                {
                }
            ]
        },
        {
            "projecttitle" : "Banano Icecream",
            "hashtags" : [
                "Js",
                "typescript",
                "web 3",
                "css"
            ],
            "color" : "#F6D919",
            "image" : "bananoicecream.webp",
            "shortdescription" : "<p>This was part of a booster contest where people create new things for the banano cryptocurrency and win prizes. This came 5th out of 20 applicants. </p><p>Developing a crawler for a chain that doesn't inherently support NFTs, Various developers and users of the cryptocurrency banano worked on creating a system for NFTs. Banano icecream is designed to find and crawl the metadata for NFTs. </p><p>You can test it out with this banano address > <strong>ban_3i9hw6xuiqwgnkbmszyadubsynjysntsw6tkk98tg7qfj3f8nwzaqtkc5pw3.</strong></p>",
            "link" : [
                {
                    "Website" : "https://arxhtects.github.io/bananoIcecream/",
                    "Github" : "https://github.com/Arxhtects/Arxhtects.github.io/tree/main/bananoIcecream",
                    "Booster Contest" : "https://banano.cc/blog/booster2-winners-announcement"
                }
            ]
        },
        {
            "projecttitle" : "Floaty Boxxy",
            "hashtags" : [
                "java",
                "android",
                "google play",
                "android studio",
                "open source"
            ],
            "color" : "#20DBA8",
            "image" : "floatyboxxy.webp",
            "shortdescription" : "<p><strong>My first playable game, released on the google play store.</strong> </p><p>The concept is very simple and nothing more than tap to keep the box floating, avoid some boxes, collect others. </p><p>The game was built in android studio and coded in java. This was simply a learning experience, but learned alot about coding with java.</p>",
            "link" : [
                {
                    "Github" : "https://github.com/Arxhtects/Floaty-Boxxy"
                }
            ]
        },
        {
            "projecttitle" : "N073_5",
            "hashtags" : [
                "java",
                "android",
                "google play",
                "android studio"
            ],
            "color" : "#ffffff",
            "image" : "terminalnotetaker.webp",
            "shortdescription" : "<p>A lightweight, Note taking app designed to look like vim/cli based text editors.</p><p>A Note taking app is super easy to make, however something i noticed was very few provided an ability to just take notes and transfer them easily while also being very light weight.</p><p>So I created a very simple android app that lets you create as many txt format files, very quickly. A note taking app I personally use regularly.</p>",
            "link" : [
                {
                    "Article" : "https://android.gadgethacks.com/how-to/take-notes-terminal-interface-with-linux-style-app-0182127/",
                    "Google Play" : "https://play.google.com/store/apps/details?id=archtectsproductions.terminalnotesFree&pli=1",
                    "Github" : "https://github.com/Arxhtects/Fake-Android-Terminal"
                }
            ]
        },
        {
            "projecttitle" : "Pagey Transitions",
            "hashtags" : [
                "php",
                "wordpress",
                "plugin",
                "open source"
            ],
            "color" : "#F95723",
            "image" : "pageytransitions.webp",
            "shortdescription" : "<p>A very simple plugin, that adds page transitions to all internal links of a wordpress site. It was designed to be editable and opensource. You can set the colors of the loading animation, the page transitions, and select from a number of preset types or code your own. </p><p>There is a second additional plugin that can be added that adds a very simple light weight page animation, as you scroll you can make divs appear, and images show in various predefined ways and also code your own styled ones.</p>",
            "link" : [
                {
                    "Github Transitions" : "https://github.com/Arxhtects/wizardy-pagey-transitions",
                    "Github Animations" : "https://github.com/Arxhtects/wizardy-pagey-animations"
                }
            ]
        },
        {
            "projecttitle" : "Onepage Scroll",
            "hashtags" : [
                "coffescript",
                "js",
                "open source"
            ],
            "color" : "#2EB3FF",
            "image" : "singlescroll.webp",
            "shortdescription" : "<p>A very light weight, single scrolling page script. No jquery, pure vanilla javascript.</p>",
            "link" : [
                {
                    "Github" : "https://github.com/Arxhtects/LightWeight-Onepage-Scroll",
                    "Codepen" : "https://codepen.io/Archtects/pen/BVBomg"
                }
            ]
        }
    ]
}
